tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "ringohub/redis-cli"
# Simple, modern, secure file encryption
brew "age"
# Avro command-line tools and utilities
brew "avro-tools"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern replacement for 'ls'
brew "exa"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU grep, egrep and fgrep
brew "grep"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Next-gen compiler infrastructure
brew "llvm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Next-gen compiler infrastructure
brew "llvm@11"
# Tools for zmodem/xmodem/ymodem file transfer
brew "lrzsz"
# Java-based project management
brew "maven"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Version control system designed to be a better CVS
brew "subversion"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Additional completion definitions for zsh
brew "zsh-completions"
# Install the redis-cli only.
brew "ringohub/redis-cli/redis-cli"
# Menu bar icon organiser
cask "bartender"
cask "font-maple-mono"
cask "font-maple-mono-nf-cn"
# System and utility switches
cask "only-switch"
# Tool for uploading images
cask "picgo"
# Rime input method engine
cask "squirrel-app"
# System monitor for the menu bar
cask "stats"
# Open-source code editor
cask "visual-studio-code"
vscode "1943time.inkdown"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.bookmarks"
vscode "alibaba-cloud.tongyi-lingma"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "foam.foam-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "josetr.cmake-language-support-vscode"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "rednote.rednote-codewiz"
vscode "ryu1kn.partial-diff"
vscode "tboox.xmake-vscode"
vscode "timonwong.shellcheck"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "xaver.clang-format"
vscode "zhuangtongfa.material-theme"
npm "clawhub"
npm "pnpm"

# --- required by dotfile bootstrap, ensure present ---
brew "stow"
cask "font-maple-mono-nf"
