tap "homebrew/cask-fonts"
# Simple, modern, secure file encryption
brew "age"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU grep, egrep and fgrep
brew "grep"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tools for zmodem/xmodem/ymodem file transfer
brew "lrzsz"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Additional completion definitions for zsh
brew "zsh-completions"

# --- required by dotfile bootstrap, ensure present ---
brew "stow"
cask "font-maple-mono-nf"
cask "font-maple-mono"
cask "font-maple-mono-nf-cn"
